{
  "user_input": {
    "nama_penyusun": "Andi Sabda, S.Pd",
    "institusi": "UPT SMP Negeri 2 Rumbia",
    "tahun_pembuatan": "2025",
    "mata_pelajaran": "Bahasa Inggris",
    "jenjang": "SMP",
    "kelas": "7",
    "alokasi_waktu": "40",
    "tahapan": "FASE D",
    "capaian_pembelajaran": "Peserta didik mampu  menyebutkan berbagai macam pekerjaan (profesi) dalam Bahasa Inggris",
    "domain_konten": "profession",
    "tujuan_pembelajaran": "Peserta didik mampu  menyebutkan berbagai macam pekerjaan (profesi) dalam Bahasa Inggris",
    "konten_utama": "profession",
    "prasyarat": "Peserta didik mengetahui macam-macam profesi.",
    "pemahaman_bermakna": "Melalui pertanyaan pemantik yang diberikan oleh guru diawal pembelajaran peserta didik dapat mengetahui macam-macam profesi berdasarkan pertanyaan pemantik yang diberikan.",
    "profil_pelajar": "Bernalar kritis, Mandiri",
    "sarana": "Papan tulis, buku siswa, HP, jaringan internet",
    "target_peserta": "Peserta didik regular",
    "jumlah_peserta": "30",
    "model_pembelajaran": "",
    "sumber_belajar": "Buku siswa dan buku guru“ English in Mind- student’s & teacher’s book second edition class VII” Penerbit Pusat kurikulum dan perbukuan Badan Penelitian dan Pengembangan dan Perbukuan Kementerian Pendidikan, Kebudayaan, Riset, dan Tekhnologi, Herbert puchta dkk, tahun 2021.",
    "catatan": ""
  },
  "rpp": {
    "rpp_bahasa_inggris": {
      "identitas": {
        "nama_penyusun": "Andi Sabda, S.Pd",
        "institusi": "UPT SMP Negeri 2 Rumbia",
        "tahun_pembuatan": "2025",
        "mata_pelajaran": "Bahasa Inggris",
        "jenjang": "SMP",
        "kelas": "VII",
        "alokasi_waktu": "40 Menit",
        "tahapan": "FASE D"
      },
      "komponen_pembelajaran": {
        "capaian_pembelajaran": "Peserta didik mampu menyebutkan berbagai macam pekerjaan (profesi) dalam Bahasa Inggris dan memahami fungsi serta peranan masing-masing profesi dalam kehidupan masyarakat.",
        "domain_konten": "Profession (Vocabulary)",
        "tujuan_pembelajaran": [
          "Setelah mengikuti pembelajaran, peserta didik mampu menyebutkan minimal 10 macam pekerjaan (profesi) dalam Bahasa Inggris dengan benar (Listening and Speaking).",
          "Setelah mengikuti pembelajaran, peserta didik mampu menuliskan minimal 5 macam pekerjaan (profesi) dalam Bahasa Inggris dengan ejaan yang benar (Writing).",
          "Setelah mengikuti pembelajaran, peserta didik mampu mengidentifikasi profesi dalam konteks gambar atau teks sederhana dengan akurasi 80% (Reading).",
          "Setelah mengikuti pembelajaran, peserta didik dapat menjelaskan pentingnya berbagai profesi dalam masyarakat (Speaking and Writing)."
        ],
        "konten_utama": {
          "linguistik": [
            "Vocabulary: doctor, teacher, engineer, nurse, pilot, police officer, firefighter, chef, farmer, musician, programmer, accountant, artist, writer, architect, etc.",
            "Simple Sentences: He/She is a…."
          ],
          "tematik": "Various Professions and their Roles in Society"
        },
        "prasyarat_pengetahuan": [
          "Peserta didik mengenal berbagai macam pekerjaan (profesi) dalam Bahasa Indonesia.",
          "Peserta didik mampu membaca dan menulis huruf alfabet Bahasa Inggris."
        ],
        "pemahaman_bermakna": "Pembelajaran ini dirancang agar peserta didik memahami beragam profesi, meningkatkan kosakata Bahasa Inggris, dan menghargai peran penting setiap profesi dalam masyarakat.  Melalui aktivitas interaktif, peserta didik akan termotivasi untuk mempelajari lebih banyak tentang profesi dan menghubungkannya dengan kehidupan sehari-hari.",
        "profil_pelajar_pancasila": {
          "dimensi_1": "Bernalar Kritis: Peserta didik dilatih untuk mengidentifikasi dan menganalisis informasi terkait profesi dari berbagai sumber, serta menghubungkannya dengan pengetahuan sebelumnya.",
          "dimensi_2": "Mandiri: Peserta didik didorong untuk belajar secara mandiri melalui kegiatan individu dan berpasangan, serta bertanggung jawab atas proses dan hasil belajarnya.",
          "dimensi_3": "Kreatif: Peserta didik diberikan kesempatan untuk mengekspresikan pemahamannya tentang profesi melalui gambar, tulisan, dan presentasi."
        },
        "sarana_prasarana": [
          "Papan tulis/Whiteboard",
          "Buku siswa dan guru (English in Mind- student’s & teacher’s book second edition class VII)",
          "Gambar-gambar berbagai profesi",
          "Kartu gambar profesi",
          "HP (untuk presentasi jika memungkinkan)",
          "Jaringan internet (opsional)"
        ],
        "target_peserta_didik": "Peserta didik regular dengan kemampuan Bahasa Inggris beragam.",
        "jumlah_peserta_didik": "30",
        "model_pembelajaran": {
          "nama_model": "Pembelajaran Berbasis Proyek (Project-Based Learning)",
          "alasan_pemilihan": "Model PBL dipilih karena memungkinkan peserta didik aktif terlibat dalam proses pembelajaran, mengembangkan keterampilan kolaborasi, dan menghasilkan produk nyata yang merepresentasikan pemahaman mereka tentang profesi.",
          "tahapan": [
            "Fase Orientasi",
            "Fase Perencanaan",
            "Fase Pelaksanaan",
            "Fase Presentasi",
            "Fase Refleksi"
          ]
        },
        "sumber_belajar": [
          "Puchta, Herbert, et al. 2021. English in Mind- student’s & teacher’s book second edition class VII. Jakarta: Pusat Kurikulum dan Perbukuan Badan Penelitian dan Pengembangan dan Perbukuan Kementerian Pendidikan, Kebudayaan, Riset, dan Teknologi."
        ]
      },
      "kegiatan_pembelajaran": {
        "kegiatan_awal": {
          "durasi": "15 Menit",
          "langkah_kegiatan": [
            {
              "aktivitas": "Salam dan Doa",
              "waktu": "2 menit",
              "peran_guru": "Memimpin doa dan memberikan salam.",
              "peran_siswa": "Ikut berdoa dan membalas salam."
            },
            {
              "aktivitas": "Apersepsi",
              "waktu": "5 menit",
              "peran_guru": "Menanyakan kepada siswa tentang profesi orang tua mereka atau profesi yang mereka kenal.",
              "peran_siswa": "Menjawab pertanyaan guru dan berdiskusi singkat.",
              "pertanyaan": [
                "What does your father/mother do?",
                "What are some jobs you know?"
              ]
            },
            {
              "aktivitas": "Motivasi",
              "waktu": "3 menit",
              "peran_guru": "Menayangkan video singkat tentang berbagai profesi atau menunjukkan gambar-gambar profesi.",
              "peran_siswa": "Menonton video atau mengamati gambar dan merespon.",
              "pertanyaan": [
                "What are the professions in the video/picture?",
                "Why are these professions important?"
              ]
            },
            {
              "aktivitas": "Menyampaikan Tujuan Pembelajaran",
              "waktu": "3 menit",
              "peran_guru": "Menjelaskan tujuan pembelajaran yang akan dicapai.",
              "peran_siswa": "Mendengarkan dan mencatat tujuan pembelajaran."
            },
            {
              "aktivitas": "Pre-test (Informal)",
              "waktu": "2 menit",
              "peran_guru": "Mengajukan beberapa pertanyaan sederhana tentang profesi yang sudah diketahui siswa.",
              "peran_siswa": "Menjawab pertanyaan guru secara lisan."
            }
          ]
        },
        "kegiatan_inti": {
          "durasi": "90 Menit",
          "langkah_kegiatan": [
            {
              "aktivitas": "Pengenalan Kosakata Profesi",
              "waktu": "15 menit",
              "peran_guru": "Menjelaskan dan mempraktikkan pengucapan kosakata profesi baru.",
              "peran_siswa": "Mengulangi pengucapan dan menuliskan kosakata baru.",
              "pengelompokan": "Kelas",
              "pertanyaan_kunci": [
                "How do you pronounce this word?",
                "Can you use this word in a sentence?"
              ]
            },
            {
              "aktivitas": "Aktivitas Berpasangan",
              "waktu": "20 menit",
              "peran_guru": "Membagi siswa dalam kelompok berpasangan untuk mendiskusikan dan mempraktikkan kalimat sederhana menggunakan kosakata profesi.",
              "peran_siswa": "Berdiskusi dan mempraktikkan kalimat sederhana dengan pasangan.",
              "pengelompokan": "Berpasangan",
              "pertanyaan_kunci": [
                "What is his/her job?",
                "Can you make a sentence about this profession?"
              ]
            },
            {
              "aktivitas": "Mencari Informasi (individu)",
              "waktu": "15 menit",
              "peran_guru": "Meminta siswa untuk mencari informasi tambahan tentang berbagai profesi (gambar, teks pendek, dll).",
              "peran_siswa": "Mencari informasi dan membuat catatan singkat.",
              "pengelompokan": "Individu",
              "pertanyaan_kunci": [
                "Where can you find information about this profession?",
                "What are the duties of this profession?"
              ]
            },
            {
              "aktivitas": "Presentasi Kelompok Kecil",
              "waktu": "20 menit",
              "peran_guru": "Membagi siswa dalam kelompok kecil untuk mempresentasikan temuan mereka tentang satu profesi.",
              "peran_siswa": "Membuat presentasi singkat dan mempresentasikan di depan kelas.",
              "pengelompokan": "Kelompok Kecil (4-5 orang)",
              "pertanyaan_kunci": [
                "What are the main tasks of this profession?",
                "Why is this profession important for our society?"
              ]
            },
            {
              "aktivitas": "Diskusi Kelas",
              "waktu": "20 menit",
              "peran_guru": "Memfasilitasi diskusi kelas untuk membahas presentasi dan memperdalam pemahaman tentang profesi.",
              "peran_siswa": "Berpartisipasi aktif dalam diskusi kelas.",
              "pengelompokan": "Kelas",
              "pertanyaan_kunci": [
                "What are the similarities and differences between these professions?",
                "Which profession are you most interested in and why?"
              ]
            }
          ],
          "strategi_diferensiasi": {
            "kemampuan_tinggi": "Siswa diberikan tugas tambahan untuk membuat cerita pendek tentang berbagai profesi.",
            "kemampuan_sedang": "Siswa diberikan kesempatan untuk membuat presentasi lebih detail dengan bantuan guru.",
            "kemampuan_rendah": "Siswa diberikan bantuan ekstra untuk memahami kosakata dan kalimat sederhana."
          }
        },
        "kegiatan_penutup": {
          "durasi": "15 Menit",
          "langkah_kegiatan": [
            {
              "aktivitas": "Kesimpulan",
              "waktu": "5 menit",
              "peran_guru": "Meringkas kembali materi yang telah dipelajari.",
              "peran_siswa": "Mendengarkan kesimpulan dan mencatat poin penting."
            },
            {
              "aktivitas": "Refleksi",
              "waktu": "5 menit",
              "peran_guru": "Mengajukan pertanyaan refleksi kepada siswa.",
              "peran_siswa": "Menjawab pertanyaan refleksi.",
              "pertanyaan_refleksi": [
                "What did you learn today?",
                "What was the most interesting part of the lesson?",
                "What are you still confused about?"
              ]
            },
            {
              "aktivitas": "Post-test",
              "waktu": "3 menit",
              "peran_guru": "Memberikan kuis singkat untuk menguji pemahaman siswa.",
              "peran_siswa": "Menjawab kuis secara tertulis."
            },
            {
              "aktivitas": "Pengumuman Tugas Rumah",
              "waktu": "2 menit",
              "peran_guru": "Memberikan tugas rumah untuk memperkuat pemahaman.",
              "peran_siswa": "Mencatat tugas rumah."
            },
            {
              "aktivitas": "Salam Penutup",
              "waktu": "2 menit",
              "peran_guru": "Memberikan salam penutup.",
              "peran_siswa": "Membalas salam."
            }
          ]
        }
      },
      "materi_dan_assessment": {
        "bahan_ajar": {
          "teori": "Berbagai macam pekerjaan (profesi) dalam bahasa Inggris dan peran masing-masing profesi dalam masyarakat. Materi ini akan dijelaskan dengan contoh gambar dan kalimat sederhana dalam bahasa Inggris.  Contohnya, seorang dokter (doctor) merawat orang sakit (treats sick people), seorang guru (teacher) mengajar siswa (teaches students), dan seorang polisi (police officer) menjaga ketertiban (keeps order).  Masing-masing profesi memiliki peran penting dalam menjaga keseimbangan dan kemajuan masyarakat.  Dengan memahami beragam profesi, kita dapat lebih menghargai kerja keras dan kontribusi mereka dalam kehidupan sehari-hari.  Pembahasan juga akan mencakup kalimat sederhana untuk mendeskripsikan profesi, misalnya:  \"He is a doctor.\"  \"She is a teacher.\"  Siswa juga akan belajar bagaimana menggunakan kalimat tersebut dalam konteks yang berbeda.",
          "materi_linguistik": {
            "grammar": "Kalimat sederhana (Simple Sentences) dengan pola Subject + Verb + Complement (He/She is a…)",
            "vocabulary": [
              "doctor",
              "teacher",
              "engineer",
              "nurse",
              "pilot",
              "police officer",
              "firefighter",
              "chef",
              "farmer",
              "musician",
              "programmer",
              "accountant",
              "artist",
              "writer",
              "architect"
            ]
          },
          "teks_lengkap": "Teks bacaan singkat (sekitar 250-300 kata) yang menceritakan tentang berbagai profesi dan peran mereka dalam masyarakat.  Teks akan disesuaikan dengan kemampuan bahasa Inggris siswa kelas VII SMP. Contohnya :  A doctor helps people to be healthy. A teacher teaches students many things in school. An engineer builds bridges and buildings. A nurse takes care of patients in the hospital. A pilot flies airplanes. A police officer keeps the city safe. A firefighter saves people and properties from fire. A chef cooks delicious foods. A farmer grows food for us. A musician plays music that entertains people.  Each profession plays a vital role in making our community a better place to live in. We must appreciate and respect everyone's work, regardless of their profession.",
          "materi_visual": "Gambar-gambar berbagai profesi yang berwarna dan menarik, disusun dalam slide presentasi atau ditempel di papan tulis.  Gambar dipilih untuk mewakili berbagai jenis profesi dan mudah dipahami oleh siswa."
        },
        "remedial": {
          "aktivitas": "Siswa yang belum mencapai KKM akan diberikan bimbingan tambahan berupa latihan pengucapan kosakata dan penyusunan kalimat sederhana dengan bantuan guru.  Mereka juga akan diberikan lembar kerja tambahan dengan gambar dan pertanyaan sederhana yang fokus pada kosakata profesi.  Guru akan memberikan bimbingan individual dan memastikan mereka memahami konsep dasar materi.",
          "strategi_intervensi": [
            "Pembelajaran individual dengan fokus pada kosakata dan pengucapan.",
            "Penggunaan media visual yang lebih sederhana dan interaktif.",
            "Latihan tambahan dengan pertanyaan yang lebih mudah."
          ],
          "instrumen_penilaian": "Lembar kerja tambahan dengan soal pilihan ganda dan menjodohkan tentang profesi."
        },
        "pengayaan": {
          "aktivitas": [
            "Membuat presentasi video singkat tentang profesi yang dipilih.",
            "Menulis cerita pendek (minimal 150 kata) tentang pengalaman bertemu dengan orang-orang dari berbagai profesi.",
            "Melakukan riset kecil tentang profesi masa depan dan presentasikan dalam bentuk poster."
          ],
          "produk_yang_diharapkan": "Video presentasi, cerita pendek, atau poster yang kreatif dan informatif."
        },
        "assessment": {
          "penilaian_pengetahuan": {
            "teknik": "Tes tertulis",
            "bentuk_instrumen": "Pilihan ganda dan menjodohkan",
            "kisi_kisi": "Mencakup seluruh kosakata profesi dan kalimat sederhana yang telah dipelajari.",
            "instrumen": [
              "1. What is the English word for 'dokter'? a. Teacher b. Doctor c. Nurse d. Engineer",
              "2.  What does a teacher do? a. Treats sick people b. Teaches students c. Builds houses d. Flies airplanes",
              "3. Match the profession with its description:",
              "a. Police Officer 1. Cooks food",
              "b. Chef 2. Keeps order",
              "c. Pilot 3. Flies airplane",
              "4. He ______ a firefighter. a. is b. am c. are d. be",
              "5. She _____ a nurse. a. is b. am c. are d. be"
            ],
            "kunci_jawaban": [
              "b",
              "b",
              "a-2, b-1, c-3",
              "a",
              "a"
            ],
            "pedoman_penskoran": "Nilai = (Jumlah jawaban benar / Jumlah soal) x 100"
          },
          "penilaian_keterampilan_mengucapkan": {
            "teknik": "Tes lisan",
            "aspek_penilaian": [
              {
                "nama_aspek": "Pengucapan",
                "deskripsi": [
                  {
                    "level": "Sempurna",
                    "skor": 5
                  },
                  {
                    "level": "Ada kesalahan kecil, tetapi tidak mengganggu pemahaman",
                    "skor": 4
                  },
                  {
                    "level": "Ada beberapa kesalahan yang mengganggu pemahaman",
                    "skor": 3
                  },
                  {
                    "level": "Banyak kesalahan yang sangat mengganggu pemahaman",
                    "skor": 2
                  },
                  {
                    "level": "Tidak dapat dimengerti",
                    "skor": 1
                  }
                ]
              },
              {
                "nama_aspek": "Kelancaran",
                "deskripsi": [
                  {
                    "level": "Sangat lancar",
                    "skor": 5
                  },
                  {
                    "level": "Lancar",
                    "skor": 4
                  },
                  {
                    "level": "Cukup lancar",
                    "skor": 3
                  },
                  {
                    "level": "Kurang lancar",
                    "skor": 2
                  },
                  {
                    "level": "Tidak lancar",
                    "skor": 1
                  }
                ]
              }
            ],
            "penentuan_nilai": "Nilai = (Jumlah skor yang diperoleh / Skor maksimal) x 100",
            "instrumen": "Siswa diminta untuk menyebutkan minimal 10 profesi dalam Bahasa Inggris dengan benar."
          },
          "penilaian_keterampilan_menulis": {
            "teknik": "Tes tertulis",
            "instrumen": "Siswa diminta untuk menuliskan 5 profesi dalam bahasa Inggris dengan ejaan yang benar.",
            "rubrik": {
              "ejaan": {
                "sangat_baik": "Semua ejaan benar",
                "baik": "Satu kesalahan ejaan",
                "cukup": "Dua kesalahan ejaan",
                "perlu_bimbingan": "Lebih dari dua kesalahan ejaan"
              }
            },
            "pedoman_penskoran": "Nilai = (Jumlah skor yang diperoleh / Skor maksimal) x 100"
          }
        }
      }
    }
  },
  "questions": {
    "soal_bahasa_inggris": {
      "judul": "Soal Evaluasi Bahasa Inggris - Various Professions",
      "kelas": "SMP Kelas VII",
      "identitas": {
        "nama_sekolah": "Sekolah Menengah Pertama X",
        "mata_pelajaran": "Bahasa Inggris",
        "alokasi_waktu": "60 menit",
        "petunjuk": "Jawablah semua pertanyaan dengan teliti dan jujur.  Good luck!"
      },
      "pilihan_ganda": [
        {
          "nomor": 1,
          "paragraf": "My uncle is a pilot. He flies airplanes all over the world.  He needs to be very skilled and responsible because he carries many passengers.  It's a challenging but exciting job. He often tells me stories about his travels. He loves his job very much.",
          "pertanyaan": "What is my uncle's profession?",
          "pilihan": {
            "A": "Teacher",
            "B": "Doctor",
            "C": "Pilot",
            "D": "Engineer"
          },
          "kunci_jawaban": "C"
        },
        {
          "nomor": 2,
          "paragraf": "My sister wants to be a doctor when she grows up. She loves helping people and is very good at science. She spends hours studying biology and chemistry.  She volunteers at the local hospital to gain experience. She is a very dedicated student.",
          "pertanyaan": "What profession does my sister aspire to?",
          "pilihan": {
            "A": "Nurse",
            "B": "Pilot",
            "C": "Doctor",
            "D": "Teacher"
          },
          "kunci_jawaban": "C"
        },
        {
          "nomor": 3,
          "paragraf": "Ms. Sarah is a dedicated teacher. She teaches English to junior high school students. She is patient and kind, always willing to help her students understand the lessons. She makes learning fun and engaging. She loves seeing her students grow and succeed.",
          "pertanyaan": "What is Ms. Sarah's job?",
          "pilihan": {
            "A": "Engineer",
            "B": "Teacher",
            "C": "Nurse",
            "D": "Pilot"
          },
          "kunci_jawaban": "B"
        },
        {
          "nomor": 4,
          "paragraf": "My father is an engineer. He designs and builds bridges.  He uses his knowledge of mathematics and physics to create strong and safe structures. It is a very demanding job requiring great precision and attention to detail. He is very proud of his work.",
          "pertanyaan": "What is my father's profession?",
          "pilihan": {
            "A": "Doctor",
            "B": "Teacher",
            "C": "Engineer",
            "D": "Nurse"
          },
          "kunci_jawaban": "C"
        },
        {
          "nomor": 5,
          "paragraf": "Mrs. Ani is a kind and compassionate nurse. She cares for patients in the hospital.  She is always ready to assist doctors and provide comfort to those in need. Her job requires patience, empathy, and a strong work ethic.  She finds her work very rewarding.",
          "pertanyaan": "What profession does Mrs. Ani have?",
          "pilihan": {
            "A": "Pilot",
            "B": "Teacher",
            "C": "Engineer",
            "D": "Nurse"
          },
          "kunci_jawaban": "D"
        }
      ],
      "menjodohkan": {
        "petunjuk": "Pasangkan profesi di kolom A dengan deskripsi singkat di kolom B.",
        "soal": [
          {
            "nomor": 1,
            "kolom_a": "Pilot",
            "kolom_b": "Flies airplanes"
          },
          {
            "nomor": 2,
            "kolom_a": "Doctor",
            "kolom_b": "Treats patients"
          },
          {
            "nomor": 3,
            "kolom_a": "Teacher",
            "kolom_b": "Educates students"
          },
          {
            "nomor": 4,
            "kolom_a": "Engineer",
            "kolom_b": "Designs and builds structures"
          },
          {
            "nomor": 5,
            "kolom_a": "Nurse",
            "kolom_b": "Cares for patients in the hospital"
          }
        ]
      },
      "benar_salah": [
        {
          "nomor": 1,
          "terkait_paragraf": 1,
          "pernyataan": "My uncle is a doctor.",
          "kunci_jawaban": false
        },
        {
          "nomor": 2,
          "terkait_paragraf": 2,
          "pernyataan": "My sister wants to be a teacher.",
          "kunci_jawaban": false
        },
        {
          "nomor": 3,
          "terkait_paragraf": 3,
          "pernyataan": "Ms. Sarah teaches mathematics.",
          "kunci_jawaban": false
        },
        {
          "nomor": 4,
          "terkait_paragraf": 4,
          "pernyataan": "My father is an engineer who builds bridges.",
          "kunci_jawaban": true
        },
        {
          "nomor": 5,
          "terkait_paragraf": 5,
          "pernyataan": "Mrs. Ani works as a teacher.",
          "kunci_jawaban": false
        }
      ],
      "essay": [
        {
          "nomor": 1,
          "terkait_paragraf": 1,
          "pertanyaan": "Based on paragraph 1, describe the qualities a pilot needs to have.  Explain your answer.",
          "panduan_jawaban": "Students should mention qualities like skill, responsibility, and the ability to handle pressure.  They should support their answer with evidence from the paragraph (e.g., carrying passengers, challenging job)."
        },
        {
          "nomor": 2,
          "terkait_paragraf": 2,
          "pertanyaan": "According to paragraph 2, why does my sister want to become a doctor?  Provide evidence from the text to support your answer.",
          "panduan_jawaban": "Students should explain that my sister wants to be a doctor because she loves helping people and is good at science.  They should mention her studying biology and chemistry, and volunteering at the hospital as evidence."
        }
      ]
    }
  },
  "kisi_kisi": {
    "kisi_kisi": {
      "informasi": {
        "nama_sekolah": "Sekolah Menengah Pertama (Nama Sekolah)",
        "mata_pelajaran": "Bahasa Inggris",
        "kelas_semester": "VII",
        "kurikulum": "Merdeka",
        "alokasi_waktu": "90 menit",
        "jumlah_bentuk_soal": "5 Pilihan Ganda, 5 Menjodohkan, 5 Benar-Salah, 2 Essay",
        "penulis": "Guru Bahasa Inggris",
        "tahun_pelajaran": "2024/2025",
        "tempat_tanggal": "Sekolah Menengah Pertama (Nama Sekolah), (Tanggal)"
      },
      "tabel_kisi_kisi": [
        {
          "nomor": 1,
          "tujuan_pembelajaran": "Peserta didik mampu menyebutkan minimal 5 profesi dalam Bahasa Inggris dengan benar.",
          "materi": "Kosakata profesi dalam Bahasa Inggris (doctor, teacher, engineer, pilot, nurse, etc.)",
          "indikator_soal": "Menentukan padanan kata profesi dalam Bahasa Inggris.",
          "level_kognitif": "C1 (Mengingat)",
          "bentuk_soal": "Pilihan Ganda",
          "nomor_soal": "1"
        },
        {
          "nomor": 2,
          "tujuan_pembelajaran": "Peserta didik mampu menyebutkan minimal 5 profesi dalam Bahasa Inggris dengan benar.",
          "materi": "Kosakata profesi dalam Bahasa Inggris (doctor, teacher, engineer, pilot, nurse, etc.)",
          "indikator_soal": "Memilih profesi yang sesuai dengan gambar.",
          "level_kognitif": "C1 (Mengingat)",
          "bentuk_soal": "Pilihan Ganda",
          "nomor_soal": "2"
        },
        {
          "nomor": 3,
          "tujuan_pembelajaran": "Peserta didik mampu menyebutkan minimal 5 profesi dalam Bahasa Inggris dengan benar.",
          "materi": "Kosakata profesi dalam Bahasa Inggris (doctor, teacher, engineer, pilot, nurse, etc.)",
          "indikator_soal": "Mengidentifikasi profesi dari deskripsi singkat.",
          "level_kognitif": "C2 (Memahami)",
          "bentuk_soal": "Pilihan Ganda",
          "nomor_soal": "3"
        },
        {
          "nomor": 4,
          "tujuan_pembelajaran": "Peserta didik mampu menyebutkan minimal 5 profesi dalam Bahasa Inggris dengan benar.",
          "materi": "Kosakata profesi dalam Bahasa Inggris (doctor, teacher, engineer, pilot, nurse, etc.)",
          "indikator_soal": "Mencocokkan profesi dengan definisinya.",
          "level_kognitif": "C2 (Memahami)",
          "bentuk_soal": "Menjodohkan",
          "nomor_soal": "4"
        },
        {
          "nomor": 5,
          "tujuan_pembelajaran": "Peserta didik mampu menyebutkan minimal 5 profesi dalam Bahasa Inggris dengan benar.",
          "materi": "Kosakata profesi dalam Bahasa Inggris (doctor, teacher, engineer, pilot, nurse, etc.)",
          "indikator_soal": "Menentukan benar atau salah pernyataan terkait profesi.",
          "level_kognitif": "C1 (Mengingat)",
          "bentuk_soal": "Benar-Salah",
          "nomor_soal": "5"
        },
        {
          "nomor": 6,
          "tujuan_pembelajaran": "Peserta didik mampu menuliskan minimal 3 kalimat tentang profesi yang telah dipelajari.",
          "materi": "Kalimat sederhana untuk mendeskripsikan profesi (He is a doctor. She is a teacher.)",
          "indikator_soal": "Membuat kalimat sederhana yang menggambarkan profesi.",
          "level_kognitif": "C3 (Menerapkan)",
          "bentuk_soal": "Essay",
          "nomor_soal": "1"
        },
        {
          "nomor": 7,
          "tujuan_pembelajaran": "Peserta didik mampu menuliskan minimal 3 kalimat tentang profesi yang telah dipelajari.",
          "materi": "Kalimat sederhana untuk mendeskripsikan profesi (He is a doctor. She is a teacher.)",
          "indikator_soal": "Menulis paragraf singkat tentang seorang profesional, menjelaskan tugasnya.",
          "level_kognitif": "C3 (Menerapkan)",
          "bentuk_soal": "Essay",
          "nomor_soal": "2"
        },
        {
          "nomor": 8,
          "tujuan_pembelajaran": "Peserta didik mampu menyebutkan minimal 5 profesi dalam Bahasa Inggris dengan benar.",
          "materi": "Kosakata profesi dalam Bahasa Inggris (doctor, teacher, engineer, pilot, nurse, etc.)",
          "indikator_soal": "Mengurutkan kata profesi berdasarkan abjad.",
          "level_kognitif": "C2 (Memahami)",
          "bentuk_soal": "Menjodohkan",
          "nomor_soal": "1"
        },
        {
          "nomor": 9,
          "tujuan_pembelajaran": "Peserta didik mampu menyebutkan minimal 5 profesi dalam Bahasa Inggris dengan benar.",
          "materi": "Kosakata profesi dalam Bahasa Inggris (doctor, teacher, engineer, pilot, nurse, etc.)",
          "indikator_soal": "Mencocokkan gambar dengan kata profesi.",
          "level_kognitif": "C1 (Mengingat)",
          "bentuk_soal": "Menjodohkan",
          "nomor_soal": "2"
        },
        {
          "nomor": 10,
          "tujuan_pembelajaran": "Peserta didik mampu menyebutkan minimal 5 profesi dalam Bahasa Inggris dengan benar.",
          "materi": "Kosakata profesi dalam Bahasa Inggris (doctor, teacher, engineer, pilot, nurse, etc.)",
          "indikator_soal": "Menentukan benar salah pernyataan terkait pekerjaan.",
          "level_kognitif": "C1 (Mengingat)",
          "bentuk_soal": "Benar-Salah",
          "nomor_soal": "1"
        },
        {
          "nomor": 11,
          "tujuan_pembelajaran": "Peserta didik mampu menyebutkan minimal 5 profesi dalam Bahasa Inggris dengan benar.",
          "materi": "Kosakata profesi dalam Bahasa Inggris (doctor, teacher, engineer, pilot, nurse, etc.)",
          "indikator_soal": "Menentukan benar salah penulisan kata profesi.",
          "level_kognitif": "C1 (Mengingat)",
          "bentuk_soal": "Benar-Salah",
          "nomor_soal": "2"
        },
        {
          "nomor": 12,
          "tujuan_pembelajaran": "Peserta didik mampu menyebutkan minimal 5 profesi dalam Bahasa Inggris dengan benar.",
          "materi": "Kosakata profesi dalam Bahasa Inggris (doctor, teacher, engineer, pilot, nurse, etc.)",
          "indikator_soal": "Menentukan benar salah  deskripsi singkat pekerjaan.",
          "level_kognitif": "C2 (Memahami)",
          "bentuk_soal": "Benar-Salah",
          "nomor_soal": "3"
        },
        {
          "nomor": 13,
          "tujuan_pembelajaran": "Peserta didik mampu menyebutkan minimal 5 profesi dalam Bahasa Inggris dengan benar.",
          "materi": "Kosakata profesi dalam Bahasa Inggris (doctor, teacher, engineer, pilot, nurse, etc.)",
          "indikator_soal": "Menentukan benar salah terkait alat yang digunakan dalam sebuah pekerjaan.",
          "level_kognitif": "C2 (Memahami)",
          "bentuk_soal": "Benar-Salah",
          "nomor_soal": "4"
        },
        {
          "nomor": 14,
          "tujuan_pembelajaran": "Peserta didik mampu menyebutkan minimal 5 profesi dalam Bahasa Inggris dengan benar.",
          "materi": "Kosakata profesi dalam Bahasa Inggris (doctor, teacher, engineer, pilot, nurse, etc.)",
          "indikator_soal": "Menentukan benar salah terkait tempat kerja profesi tertentu.",
          "level_kognitif": "C2 (Memahami)",
          "bentuk_soal": "Benar-Salah",
          "nomor_soal": "5"
        },
        {
          "nomor": 15,
          "tujuan_pembelajaran": "Peserta didik mampu menyebutkan minimal 5 profesi dalam Bahasa Inggris dengan benar.",
          "materi": "Kosakata profesi dalam Bahasa Inggris (doctor, teacher, engineer, pilot, nurse, etc.)",
          "indikator_soal": "Menyebutkan 5 profesi dalam Bahasa Inggris.",
          "level_kognitif": "C1 (Mengingat)",
          "bentuk_soal": "Pilihan Ganda",
          "nomor_soal": "4"
        },
        {
          "nomor": 16,
          "tujuan_pembelajaran": "Peserta didik mampu menyebutkan minimal 5 profesi dalam Bahasa Inggris dengan benar.",
          "materi": "Kosakata profesi dalam Bahasa Inggris (doctor, teacher, engineer, pilot, nurse, etc.)",
          "indikator_soal": "Menyebutkan 5 profesi dalam Bahasa Inggris.",
          "level_kognitif": "C1 (Mengingat)",
          "bentuk_soal": "Pilihan Ganda",
          "nomor_soal": "5"
        }
      ]
    }
  }
}